Task 1 Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление. .
Task 2 Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя.
Task 3 Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.
Task 4 Программа принимает действительное положительное число x и целое отрицательное число y. Необходимо выполнить возведение числа x в степень y.
Task 5  Программа запрашивает у пользователя строку чисел, разделенных пробелом. При нажатии Enter должна выводиться сумма чисел.
Task 6 Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же, но с прописной первой буквой.